////? Alert (Попередження):
////? Використовується для відображення повідомлення користувачу з кнопкою "OK". Наприклад:
////? window.alert("Це попередження!");
////? Prompt (Запит):
////? Використовується для отримання введеного користувачем значення. Він також має кнопки "OK" і "Cancel". Наприклад:
////? let result = window.prompt("Будь ласка, введіть своє ім'я", "Гість");
////? Confirm (Підтвердження):
////? Використовується для підтвердження або скасування дії користувачем. Має кнопки "OK" і "Cancel". Наприклад:
////? let result = window.confirm("Ви впевнені, що хочете видалити цей елемент?");
//let result = prompt("Будь ласка, введіть своє ім'я")
//let trueInfo = confirm('Привіт '+ result+'! Сьогодні сонячний день?')
//if(trueInfo){
//    alert('Щасливої прогулянки')
//}else{
//    alert('Не забудь вдягнути куртку!') 
//}


//?Цикл for використовується тоді, коли відомо точну кількість ітерацій, які потрібно виконати. Він має три частини:

//*Ініціалізація
//*Умова
//*Інкремент (або декремент)
//for (ініціалізація; умова; інкремент/декремент) {
// код, який виконується на кожній ітерації
//  }
let result = 0
let user = prompt("Привіт!  Будь ласка, введи своє ім'я, щоб розпочати")
let test = confirm("Готовий пройти тест про країни?")
let questions = [
    { question: "Назвіть столицю Франції (Напиши відповідь з великої букви!!!)", input: "Париж" },
    { question: "Назвіть столицю Укрїни (Напиши відповідь з великої букви!!!)", input: "Київ" },
    { question: "Назвіть столицю Польщі (Напиши відповідь з великої букви!!!)", input: "Варшава" },
    { question: "Назвіть столицю Угорщини (Напиши відповідь з великої букви!!!)", input: "Будапешт" },
    { question: "Назвіть столицю Чехії (Напиши відповідь з великої букви!!!)", input: "Прага" },
    { question: "Назвіть столицю Англії (Напиши відповідь з великої букви!!!)", input: "Лондон" },
    { question: "Назвіть столицю Вірменії (Напиши відповідь з великої букви!!!)", input: "Єреван" },
    { question: "Назвіть столицю Литви (Напиши відповідь з великої букви!!!)", input: "Вільнюс" },
    { question: "Назвіть столицю Латвії (Напиши відповідь з великої букви!!!)", input: "Рига" },
    { question: "Назвіть столицю Італії (Напиши відповідь з великої букви!!!)", input: "Рим" }
]
if (test) {
    for (let i = 0; i < questions.length; i++) {
        let questions = prompt(questions[i].question)
        if (questions == questions[i].input) result += 1

    }
    alert(user+'твій результат'+ result+" балів з 10")
}
alert('Молодець !')